app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("author", "text", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "Robert"], ["text", "This is a comment!"], ["post_id", 1], ["created_at", "2015-07-31 03:32:11.238571"], ["updated_at", "2015-07-31 03:32:11.238571"]]

  def update
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.update(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "comments" SET "text" = $1 WHERE "comments"."id" = $2  [["text", "This is a comment."], ["id", 2]]