app/controllers/posts_controller.rb

  def create
    @user = User.find(session[:user]["id"])
    @post = Post.create!(post_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "posts" ("author", "title", "text", "date") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "posts" SET "text" = $1 WHERE "posts"."id" = $2  [["text", "Changed!"], ["id", 1]]